WcfHarness/WcfHarness/RequestXmls/DeletePermission_SoftDelete.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeletePermission xmlns="http://www.tavisca.com/Vexiere/IPermission/2013/01">
      <deletePermissionRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:IsHardDelete>false</a:IsHardDelete>
        <a:PermissionIdentifier i:type="a:IdBasedPermissionIdentifier">
          <a:Id>23343742</a:Id>
        </a:PermissionIdentifier>
      </deletePermissionRequest>
    </DeletePermission>
  </s:Body>
</s:Envelope>